Documents/абс_ЗаявкаНаБюджетОтделаТМ/абс_ЗаявкаНаБюджетОтделаТМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗаявкаНаБюджетОтделаТМ</name>
  <registerRecords>AccumulationRegister.абс_БюджетОтделаТМ</registerRecords>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийЗаявкиНаБюджетТМ</types>
    </type>
  </attributes>
  <attributes>
    <name>Закрыта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МесяцОтнесенияЗатрат</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяБюджета</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаБюджета</name>
    <type>
      <types>CatalogRef.абс_АналитикиБюджета</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтапСогласования</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньСогласования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

AccumulationRegisters/абс_БюджетОтделаТМ/абс_БюджетОтделаТМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>абс_БюджетОтделаТМ</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаНаБюджетОтделаТМ</name>
    <type>
      <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

InformationRegisters/абс_СостоянияСогласованияДокументов/абс_СостоянияСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СостоянияСогласованияДокументов</name>
  <comment>Состояния согласования документов</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияОбъектов</types>
    </type>
  </resources>
  <resources>
    <name>Уровень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Этап</name>
    <type>
      <types>CatalogRef.абс_МаршрутыСогласованияДокументов</types>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекущийЭтап</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>ДокументДляСогласования</name>
    <type>
      <types>DocumentRef.Лео_ЗаявкаНаАкцию</types>
      <types>DocumentRef.Лео_ЗаявкаНаОбразцы</types>
      <types>DocumentRef.Лео_ЗаявкаНаЗапчасти</types>
      <types>DocumentRef.СчетФактураПолученный</types>
      <types>DocumentRef.абс_ВводБюджета</types>
      <types>DocumentRef.абс_СтратегическиеЦелиПродаж</types>
      <types>DocumentRef.ЗаявкаНаРасходованиеСредств</types>
      <types>DocumentRef.ПоступлениеТоваровУслуг</types>
      <types>DocumentRef.ПланПродаж</types>
      <types>DocumentRef.абс_ЗаявкаНаБюджетОтделаТМ</types>
      <types>DocumentRef.Лео_ФиксацияСкидокПоТрейдМаркетингу</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Enums/абс_ВидыОперацийЗаявкиНаБюджетТМ/абс_ВидыОперацийЗаявкиНаБюджетТМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийЗаявкиНаБюджетТМ</name>
  <enumValues>
    <name>БесплатнаяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеСкидки</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_ВидыОплатУслугКонтрагентов/абс_ВидыОплатУслугКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОплатУслугКонтрагентов</name>
  <enumValues>
    <name>Безналичная</name>
  </enumValues>
  <enumValues>
    <name>Наличная</name>
  </enumValues>
  <enumValues>
    <name>БесплатнаяОтгрузка</name>
  </enumValues>
  <enumValues>
    <name>ПредоставлениеСкидки</name>
  </enumValues>
  <enumValues>
    <name>Взаимозачет</name>
  </enumValues>
</mdclass:Enum>

Enums/СостоянияОбъектов/СостоянияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияОбъектов</name>
  <comment>(Упр)</comment>
  <enumValues>
    <name>Подготовлен</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>Отложен</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
  </enumValues>
  <enumValues>
    <name>абс_Проведен</name>
    <comment>Оплачен</comment>
  </enumValues>
  <enumValues>
    <name>Лео_ОтправленНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Лео_КОплате</name>
  </enumValues>
  <enumValues>
    <name>Лео_Завершен</name>
  </enumValues>
  <enumValues>
    <name>Лео_Аннулирован</name>
  </enumValues>
  <enumValues>
    <name>Лео_ПроверенФакт</name>
  </enumValues>
</mdclass:Enum>

Enums/абс_ТипыДокументовДляСогласования/абс_ТипыДокументовДляСогласования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ТипыДокументовДляСогласования</name>
  <enumValues>
    <name>ВводБюджета</name>
  </enumValues>
  <enumValues>
    <name>СтратегическиеЦелиПродаж</name>
  </enumValues>
  <enumValues>
    <name>ПланПродаж</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаБюджетОтделаТМ</name>
  </enumValues>
  <enumValues>
    <name>ЗаявкаНаРасходованиеСредств</name>
  </enumValues>
  <enumValues>
    <name>Лео_ФиксацияСкидокПоТрейдМаркетингу</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаОбразцы</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаЗапчасти</name>
  </enumValues>
  <enumValues>
    <name>Лео_ЗаявкаНаАкцию</name>
  </enumValues>
  <enumValues>
    <name>ПоступлениеТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>СчетФактураПолученный</name>
  </enumValues>
</mdclass:Enum>

Catalogs/абс_МаршрутыСогласованияДокументов/абс_МаршрутыСогласованияДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_МаршрутыСогласованияДокументов</name>
  <comment>Маршруты согласования документов</comment>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>СогласованиеДиректором</name>
      <description>Согласование с Генеральным директором </description>
    </items>
    <items>
      <name>СогласованиеПрезидентом</name>
      <description>Согласование с Президентом</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипДокументаДляСогласования</name>
    <type>
      <types>EnumRef.абс_ТипыДокументовДляСогласования</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СогласующиеЛица</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Лео_ЛицаСДоступомНаРедактирование</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Documents/абс_ЗаявкаНаБюджетОтделаТМ/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения,СтандартнаяОбработка)
	Ответственный=ПараметрыСеанса.ТекущийПользователь;
	ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.БесплатнаяОтгрузка;
	ВидОплаты=Перечисления.абс_ВидыОплатУслугКонтрагентов.БесплатнаяОтгрузка;
	Состояние=Перечисления.СостоянияОбъектов.Подготовлен;
КонецПроцедуры

Процедура ПередЗаписью(Отказ,РежимЗаписи,РежимПроведения)
	Если ВидОперации=Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.БесплатнаяОтгрузка Тогда
		СуммаДокумента=Товары.Итог("Сумма");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.абс_БюджетОтделаТМ.Записывать = Истина;
	Движения.абс_БюджетОтделаТМ.Очистить();
	
	Если Состояние = Перечисления.СостоянияОбъектов.Утвержден Тогда
		// регистр абс_БюджетОтделаТМ Приход
		Движение = Движения.абс_БюджетОтделаТМ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗаявкаНаБюджетОтделаТМ = Ссылка;
		Движение.Сумма = СуммаДокумента;
		
		Если ВидОперации = Перечисления.абс_ВидыОперацийЗаявкиНаБюджетТМ.Взаимозачет 
			И Закрыта Тогда
			Движение = Движения.абс_БюджетОтделаТМ.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.ЗаявкаНаБюджетОтделаТМ = Ссылка;
			Движение.Сумма = СуммаДокумента;
		КонецЕсли;
			
	КонецЕсли;
	
	//Если используется механизм согласования документов ВводБюджета, и документ еще не прошел по маршуту утверждения 
	//	- добавим запись в регистр СостоянияСогласования
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаБюджетОтделаТМ,Дата) Тогда
		Если Состояние=Перечисления.СостоянияОбъектов.Подготовлен Тогда
			Запрос=Новый Запрос;
			Запрос.Текст=
			"ВЫБРАТЬ
			|	абс_СостоянияСогласованияДокументовСрезПоследних.Состояние
			|ИЗ
			|	РегистрСведений.абс_СостоянияСогласованияДокументов.СрезПоследних(, ДокументДляСогласования = &Ссылка) КАК абс_СостоянияСогласованияДокументовСрезПоследних";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			Выборка=Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если Выборка.Состояние=Перечисления.СостоянияОбъектов.Отклонен Тогда
					МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаБюджетОтделаТМ);
					Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
						Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
						ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
						Возврат;
					КонецЕсли;
					
					НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
					
					НоваяЗапись.Период = ТекущаяДата();
					НоваяЗапись.Активность = Истина;
					НоваяЗапись.ДокументДляСогласования = Ссылка;
					НоваяЗапись.Пользователь = Ответственный;
					НоваяЗапись.Этап = МаршрутСогласования;
					НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
					НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
					
					НаборЗаписейСостояниеСогласования.Записать();
					Возврат;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Документ уже пошел по маршруту согласования
			Возврат;
		КонецЕсли;
		МаршрутСогласования = абс_СогласованиеДокументов.ОпределитьМаршрутСогласования(ЦФО,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаБюджетОтделаТМ);
		Если НЕ ЗначениеЗаполнено(МаршрутСогласования) Тогда
			Заголовок = ОбщегоНазначения.ПредставлениеДокументаПриПроведении(Ссылка);
			ОбщегоНазначения.СообщитьОбОшибке("Не удалось определить маршрут согласования документа", Отказ, Заголовок);
			Возврат;
		КонецЕсли;
		//Уже есть запись с правильным маршрутом согласования
		Если НаборЗаписейСостояниеСогласования.Количество() = 1 И
			НаборЗаписейСостояниеСогласования[0].Этап = МаршрутСогласования Тогда
			Возврат;
		КонецЕсли;
		НаборЗаписейСостояниеСогласования.Очистить();
		НоваяЗапись = НаборЗаписейСостояниеСогласования.Добавить();
		
		НоваяЗапись.Период = ТекущаяДата();
		НоваяЗапись.Активность = Истина;
		НоваяЗапись.ДокументДляСогласования = Ссылка;
		НоваяЗапись.Пользователь = Ответственный;
		НоваяЗапись.Этап = МаршрутСогласования;
		НоваяЗапись.Уровень = МаршрутСогласования.Уровень() + 1;
		НоваяЗапись.Состояние = Перечисления.СостоянияОбъектов.Подготовлен;
		
		НаборЗаписейСостояниеСогласования.Записать();
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этому документу, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Состояние=Перечисления.СостоянияОбъектов.Подготовлен;
	ЭтапСогласования=Справочники.абс_МаршрутыСогласованияДокументов.ПустаяСсылка();
	УровеньСогласования=0;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	// Удаление движений по регистру абс_СостоянияСогласованияДокументов, если документ был подготовлен
	НаборЗаписейСостояниеСогласования = РегистрыСведений.абс_СостоянияСогласованияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостояниеСогласования.Отбор.ДокументДляСогласования.Установить(Ссылка);
	НаборЗаписейСостояниеСогласования.Прочитать();
	Если НаборЗаписейСостояниеСогласования.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	Если абс_СогласованиеДокументов.ИспользуетсяСогласованиеДокументов(Организация,Перечисления.абс_ТипыДокументовДляСогласования.ЗаявкаНаБюджетОтделаТМ,Дата) Тогда
		Если НаборЗаписейСостояниеСогласования.Количество() > 1 Тогда
			//Документ уже пошел по маршруту согласования, не следует ничего менять
			Возврат;
		КонецЕсли;
		//Если в наборе записей только одна запись - значит документ только подготовлен.
		//Очистим набор записей
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	ИначеЕсли НаборЗаписейСостояниеСогласования.Количество() > 0 Тогда
		//Если есть записи по этому документу, а согласование не используется - очистим
		НаборЗаписейСостояниеСогласования.Очистить();
		НаборЗаписейСостояниеСогласования.Записать();
	КонецЕсли;
КонецПроцедуры
